Revit 2026 API

# StairsPathUpTextOffset Property

---

The offset of stairs up text.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ UpTextOffset { get; set; }
```
```vb
Public Property UpTextOffset As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ UpTextOffset {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member UpTextOffset : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |
| InvalidOperationException | When setting this property: The stairs path doesn't not show up text so the data being set is inapplicable. |

The z direction makes no sense in API.

#### Reference

StairsPath Class

Autodesk.Revit.DB.Architecture Namespace